#### ReferenceableViewUtils Members

---

|  |
| --- |
| ReferenceableViewUtils Class   Methods   See Also |

The  ReferenceableViewUtils  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | ChangeReferencedView | Changes a particular reference view (such as a reference section or reference callout) to refer to a different View. |
| Public method Static member | GetReferencedViewId | Gets the id of the view referenced by a reference view (such as a reference section or reference callout). |

# See Also

ReferenceableViewUtils Class

Autodesk.Revit.DB Namespace